//打印出全部由数字1，2，3，4，组成互不相同且无重复数字的三位数
#include <stdio.h>
int main()
{
	int m = 0, n = 0;  //m计三位数的个数，n为三位数
	printf("可得到互不相同且无重复数字的三位数有:\n");  //提示词
	//利用循环语句嵌套，解决三位数会相同的问题
	for (int i = 1; i <= 4; i++)  //第一层循环定三位数的百分位
	{
		for (int j = 1; j <= 4; j++)  //第二层循环定十分位
		{
			for (int k = 1; k <= 4; k++)  //第三层循环定个位
			{
				if (i != j && j != k && k != i)  //条件语句防止重复数字
				{
					m++;
					n = 100 * i + 10 * j + k;
					printf("%d\t", n);
				}
			}
		}
	}
	printf("\n");
	printf("共有%d个三位数", m);
	return 0;
}
